Sesgaro/Ardo_aspiradora/kl25z_codes/Hub_esp32s3/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_FREERTOS_HZ=1000
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
# Coexistencia WiFi/BLE DESACTIVADA para aislar el BLE (modo WIFI_ENABLED 0).
# Con coexistencia activa el controlador BT cede connection events y se pierden
# las notificaciones espontáneas del periférico. Reactivar para WiFi+BLE.
CONFIG_ESP_WIFI_SW_COEXIST_ENABLE=n
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=n

CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
# OJO: el rol PERIPHERAL debe quedar ACTIVO aunque el hub sea solo central.
# El handler de RX de notificaciones (ble_att_svr_rx_notify) vive en el código
# GATT server (#if BLE_GATTS), y BLE_GATTS depende de ROLE_PERIPHERAL. Si se
# desactiva, el central recibe el PDU a nivel LL pero el ATT lo descarta y las
# notificaciones nunca llegan al callback.
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_GATT_SERVER=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_PINNED_TO_CORE_1=y

CONFIG_ESP_WIFI_ENABLED=y
CONFIG_MQTT_ENABLED=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=n
CONFIG_MQTT_TRANSPORT_SSL=n
CONFIG_MQTT_TRANSPORT_WEBSOCKET=n

CONFIG_ESP_COEX_SW_COEXIST_ENABLE=n
CONFIG_ESP_WIFI_SW_COEXIST_ENABLE=n
CONFIG_BT_NIMBLE_TASK_STACK_SIZE=5120
CONFIG_ESP32_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP32_WIFI_AMPDU_RX_ENABLED=n
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=32